src/InformationRegisters/Учащиеся/Учащиеся.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Учащиеся</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </resources>
  <resources>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЯвляетсяСтаростой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбучениеНаБюджетнойОснове</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ПолучениеСтудентовВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьСтудентовИзРегистра(УчебнаяГруппа, Факультет, Курс, Регистратор, ЭтотОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчащиесяСрезПоследних.Студент.Ссылка КАК Студент,
	|	УчащиесяСрезПоследних.ЯвляетсяСтаростой,
	|	УчащиесяСрезПоследних.ОбучениеНаБюджетнойОснове
	|ИЗ
	|	РегистрСведений.Учащиеся.СрезПоследних(&Период, Регистратор <> &Регистратор) КАК УчащиесяСрезПоследних
	|ГДЕ
	|	УчащиесяСрезПоследних.Факультет = &Факультет
	|	И УчащиесяСрезПоследних.УчебнаяГруппа = &УчебнаяГруппа
	|	И УчащиесяСрезПоследних.Курс = &Курс
	|
	|УПОРЯДОЧИТЬ ПО
	|	УчащиесяСрезПоследних.Студент.Наименование";

	Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппа);
	Запрос.УстановитьПараметр("Факультет", Факультет);
	Запрос.УстановитьПараметр("Курс", Курс);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Студентов по указанным данным нет!";
		Сообщение.Поле = "Студенты";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;

	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

#КонецОбласти
